# Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости,
# в которой находится эта точка.

x = int(input('Введите x:'))
y = int(input('Введите y:'))
if x != 0 and y != 0:
    if x > 0 and y > 0:
        print('Точка находится в первой плоскости')
    if x < 0 and y > 0:
        print('Точка находится во второй плоскости')
    if x < 0 and y < 0:
        print('Точка находится в третьей плоскости')
    if x > 0 and y < 0:
        print('Точка находится в четвертой плоскости')
else:
    print('обе или одна из точек равны нулю')
